# Структура проекта (MVP)
______
## Основной функицонал

Основной функционал включает в себя таймер, который контролирует время пребывания ребенка за ПК(в дальнейшем возможен релиз мобильного приложения на платформах Android и IOS)

Необходимо выбрать паттерн проектирования и принцип ведения разработки

ТехЗадача:
- [ ] Таймер (Backend)

    * Время таймера берется из константы, заданной в настройках (MVP. Значений по умолчанию 2 - 15 мин и 30 мин)
    * Таймер запускается нажатием кнопки
    * (MVP) По окончании времени таймера звучит одно из 4 музыкальных произведений выбранное случайным образом, всплывает новое окно викторины поверх всех окон
    * (MVP) Викторина включает в себя 4 варианта ответа исходя из возможных музыкальных произведений 

- [ ] Таймер (Frontend)

    * Большой потенциал для кроссплатформенного приложения лежит в стеке React'a
      1. Необходимо изучить возможности написания web-app на React'e
      2. Составить требования к интеграциям между Front и Back
    * Для MVP предлагаю использовать фреймворк PyQT [Документация](https://doc.qt.io/qtforpython-6/) [Уроки Олега Шпагина](https://youtu.be/mgxW9BRQink)
